{
    "german": {
        "goal": {
            "heading": "Unser Ziel:",
            "text": "Unser Ziel ist es, Menschen auf einfache und motivierende Weise zu einem nachhaltigeren Lebensstil zu inspirieren. Mit unserem Projekt wollen wir zeigen, dass Umweltschutz nicht kompliziert oder belehrend sein muss - sondern im Alltag beginnt, Spaß machen kann und durch kleine Schritte große Wirkung entfalten kann. Wir haben eine Anwendung entwickelt, die Nutzer*innen täglich mit konkreten Challenges, praktischen Tipps und motivierendem Feedback dabei unterstützt, ihren ökologischen Fußabdruck zu verkleinern.Ob durch bewussteren Konsum, sparsamen Energieeinsatz oder nachhaltige Mobilität - wir möchten nachhaltiges Handeln greifbar, verständlich und alltagstauglich machen. /nDabei ist uns wichtig: Niemand muss perfekt sein. Es geht nicht darum, alles richtig zu machen, sondern überhaupt anzufangen - mit kleinen, machbaren Veränderungen, die sich im Laufe der Zeit summieren. Unser Beitrag zum KTBYTE Hackathon soll nicht nur eine technische Lösung sein, sondern ein Impuls: für mehr Bewusstsein, mehr Gemeinschaft und eine lebenswertere Zukunft."
        },
        "funktion": {
            "heading": "Funktion:",
            "text": "Schritt 1: Tägliche Challenge starten. So bald du die Website öffnest, erwartet dich eine neue, konkrete Challenge für den Tag - zum Beispiel:    "
        },
        "funktion2": {
            "text": "Schritt 2: Wirkung sehen. Zu jeder Challenge zeigen wir dir, was sie bringt, so bekommst du ein besseres Gefühl für deinen Impact - und bleibst motiviert!"
        },
        "explaination": {
            "text": "Erklärung"
        },
        "funktion3": {
            "text": "Schritt 3: Challenge abhaken & Punkte sammeln. Challenge erledigt? Super! ✔️ Klicke auf „Erledigt“ und sammle Punkte für deinen Fortschritt, deine Einsparungen werden gespeichert - damit du siehst, wie viel du schon erreicht hast. Extra-Motivation: Je mehr du machst, desto mehr Level oder Badges kannst du freischalten."
        },
        "about": {
            "heading": "Über uns:",
            "text": "Wir sind David Schwendemann und Daniel Staller - zwei Schüler des Abiturjahrgangs, die auf den ersten Blick vielleicht unterschiedliche Wege gehen, aber genau darin ihre Stärke gefunden haben. Trotz - oder gerade wegen - unserer unterschiedlichen Interessen haben wir uns als Team beim KTBYTE Hackathon zusammengefunden. Der diesjährige Schwerpunkt des Wettbewerbs lautete „Social Impact“, also die Frage, wie Technologie einen positiven gesellschaftlichen Einfluss haben kann. Wir haben uns für das Unterthema „Environmental Impact“ entschieden - weil uns beiden die Zukunft unseres Planeten am Herzen liegt. Mit unserem Beitrag möchten wir nicht nur am Hackathon teilnehmen, sondern auch ein Zeichen setzen: Jeder kann einen Beitrag leisten - ob durch Technik, durch Naturverbundenheit oder durch den Mut, gemeinsam etwas Neues zu starten."
        },
        "david": {
            "text": "David ist leidenschaftlicher Programmierer, Bastler und Technik-Enthusiast. Er liebt es, digitale Lösungen zu entwickeln, kreative Ideen in Code zu verwandeln und mit moderner Technologie neue Wege zu erschließen. Wann immer er Zeit findet, tüftelt er an Projekten, im Bereich Webentwicklung oder Hardware."
        },
        "daniel": {
            "text": "Daniel fühlt sich vor allem in der Natur zu Hause. Als begeisterter Wanderer und Bushcrafter setzt er sich intensiv mit ökologischen Themen auseinander und weiß, wie wichtig der bewusste Umgang mit unserer Umwelt ist."
        },
        "emission1": {
            "text": "Ihre Emissionen:"
        },
        "emissionT": {
            "text": "CO2-Emission berechnen"
        },
        "distance": {
            "text": "Entfernung in km:"
        },
        "berechnen": {
            "text": "Berechnen"
        },
        "kraftstoff": {
            "text": "Kraftstoff:"
        },
        "benzin": {
            "text": "Benzin"
        },
        "rechner": {
            "text": "CO2-Rechner"
        },
        "impressum": {
            "text": "Impressum"
        },
        "kontakt": {
            "text": "Kontakt"
        },
        "überuns": {
            "text": "Über uns"
        }
        
    },

     "english": {
        "goal": {
            "heading": "Our goal:",
            "text": "Our aim is to inspire people to adopt a more sustainable lifestyle in a simple and motivating way. With our project, we want to show that environmental protection doesn't have to be complicated or instructive - it starts in everyday life, can be fun and can have a big impact through small steps. We have developed an application that supports users every day with concrete challenges, practical tips and motivating feedback to reduce their ecological footprint, whether through more conscious consumption, economical energy use or sustainable mobility - we want to make sustainable action tangible, understandable and suitable for everyday use. /It is important to us that nobody has to be perfect. It's not about doing everything right, but about starting at all - with small, feasible changes that add up over time. Our contribution to the KTBYTE Hackathon should not just be a technical solution, but an impulse: for more awareness, more community and a future worth living."
        },
        "funktion": {
            "heading": "Function:",
            "text": "Step 1: Start your daily challenge. As soon as you open the website, a new, specific challenge awaits you for the day - for example:"
        },
        "funktion2": {
            "text": "Step 2: See the impact. We show you the benefits of each challenge, so you get a better feel for your impact - and stay motivated!"
        },
        "explaination": {
            "text": "Explanation"
        },
        "funktion3": {
            "text": "Step 3: Check off the challenge & collect points. Challenge completed? Great! ✔️ Click on “Done” and collect points for your progress, your savings will be saved - so you can see how much you have already achieved. Extra motivation: the more you do, the more levels or badges you can unlock."
        },
        "about": {
            "heading": "About us:",
            "text": "We are David Schwendemann and Daniel Staller - two high school students who may seem to be taking different paths at first glance, but this is precisely where we have found our strength. Despite - or perhaps because of - our different interests, we came together as a team for the KTBYTE Hackathon. The focus of this year's competition was “Social Impact”, i.e. the question of how technology can have a positive impact on society. We chose the sub-theme “Environmental Impact” - because we both care about the future of our planet. With our contribution, we not only want to take part in the hackathon, but also set an example: Everyone can make a contribution - whether through technology, by being close to nature or by having the courage to start something new together."
        },
        "david": {
            "text": "David is a passionate programmer, tinkerer and technology enthusiast. He loves developing digital solutions, turning creative ideas into code and exploring new avenues with modern technology. Whenever he finds time, he tinkers with projects in the field of web development or hardware."
        },
        "daniel": {
            "text": "Daniel feels particularly at home in nature. As an enthusiastic hiker and bushcrafter, he deals intensively with ecological issues and knows how important it is to treat our environment with care."
        },
        "emission1": {
            "text": "Your emissions:"
        },
        "emissionT": {
            "text": "Calculate CO2 emissions"
        },
        "distance": {
            "text": "Distance in km:"
        },
        "berechnen": {
            "text": "Calculate"
        },
        "kraftstoff": {
            "text": "Fuel type:"
        },
        "benzin": {
            "text": "Gasoline"
        },
        "rechner": {
            "text": "CO2-calculator"
        },
        "impressum": {
            "text": "Imprint"
        },
        "kontakt": {
            "text": "Contact us"
        },
        "überuns": {
            "text": "About us"
        }
    }
}